backend/app/controllers/api/captures_controller.rb

    def show
      @capture = current_user.captures.find_by! key: params[:id]
---
SELECT  "captures".* FROM "captures" WHERE "captures"."user_id" = ? AND "captures"."key" = ? LIMIT 1  [["user_id", 1], ["key", "ica7auwMrgc9j8yC7iTjkLGAa7DWIr5l"]]

    def create
      create_params = params.require(:capture).permit(:content)
      create_params.merge! status: :pending

      @capture = current_user.captures.create! create_params
---
INSERT INTO "captures" ("content", "user_id", "key", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

    def destroy
      @capture = current_user.captures.find_by! key: params[:id]
      @capture.update! status: :merged unless params[:force]
      @capture.destroy! if params[:force]
---
SELECT  "captures".* FROM "captures" WHERE "captures"."user_id" = ? AND "captures"."key" = ? LIMIT 1  [["user_id", 1], ["key", "ica7auwMrgc9j8yC7iTjkLGAa7DWIr5l"]]
UPDATE "captures" SET "status" = ?, "content" = ?, "updated_at" = ? WHERE "captures"."id" = ?
DELETE FROM "captures" WHERE "captures"."id" = ?  [["id", 1]]