backend/app/controllers/api/templates_controller.rb

SELECT "templates".* FROM "templates" WHERE "templates"."user_id" = ?  [["user_id", 3]]
---
    def index
      @templates = current_user.templates.all

SELECT  "templates".* FROM "templates" WHERE "templates"."user_id" = ? AND "templates"."key" = ? LIMIT 1  [["user_id", 3], ["key", "2FBnNqUHduHYErQx-dQIxCLUbU-gjV86"]]
---
    def show
      @template = current_user.templates.find_by! key: params[:id]

INSERT INTO "templates" ("template", "user_id", "properties", "key", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
      template_params = params.require(:template).permit(:template)
      template_params.merge! user_id: current_user.id

      # .new + .properties= + .save! to get around arbitrary keys in the params
      @template = Template.new template_params
      @template.properties = params.require(:template)[:properties]
      @template.save!

SELECT  "templates".* FROM "templates" WHERE "templates"."user_id" = ? AND "templates"."key" = ? LIMIT 1  [["user_id", 3], ["key", "onpXf1Q9UUhZPqTxxnMXRwdsW0yEzMug"]]
UPDATE "templates" SET "properties" = ?, "updated_at" = ? WHERE "templates"."id" = ?  [["properties", "{\"new\":\"deal\"}"], ["updated_at", "2015-12-24 04:34:06.392225"], ["id", 21]]
---
    def update
      @template = current_user.templates.find_by! key: params[:id]

      update = params.require(:template).permit(:template)
      update.each { |(key, value)|
        @template[key] = value
      }

      props = params.require(:template)[:properties] || {}
      props.each { |(key, value)|
        if value == "__delete"
          @template.properties.delete(key)
        else
          @template.properties[key] = value
        end
      }

      @template.save!

SELECT  "templates".* FROM "templates" WHERE "templates"."user_id" = ? AND "templates"."key" = ? LIMIT 1  [["user_id", 3], ["key", "2FBnNqUHduHYErQx-dQIxCLUbU-gjV86"]]
DELETE FROM "templates" WHERE "templates"."id" = ?  [["id", 11]]
---
    def destroy
      @template = current_user.templates.find_by! key: params[:id]
      @template.destroy!