backend/app/controllers/api/users_controller.rb

UPDATE "users" SET "passhash" = ? WHERE "users"."id" = ?  [["passhash", "$2a$04$zwWmxsnn7LTOioLs0srMWugM8hoq8Po98weeweuIn6WYdarGvJj6S"], ["id", 5]]
---
    def update
      require_scope! :account

      current_user.update!(update_params)